# Palmer Penguins!

<img src="../images/penguins.png" alt="" width="600"/>

In [2]:
import pandas as pd
pd.set_option('display.max_columns', None)

## Dataset Explanation
The [Palmer Penguins dataset](https://github.com/allisonhorst/palmerpenguins) is composed of two CSV files: penguins.csv and raw_penguins.csv. [Kaggle](https://www.kaggle.com/datasets/parulpandey/palmer-archipelago-antarctica-penguin-data) has a data dictionary for this dataset, which helps to explain its features (i.e. columns).

| Feature | Type | Description |
|:--------------|:--------------|:-----------|
| species | string | penguin species (Chinstrap, Ad√©lie, or Gentoo) |
| bill_length_mm | float | culmen length (mm) |
| bill_depth_mm | float | culmen depth (mm) |
| flipper_length_mm | float | flipper length (mm) |
| body_mass_g | float | body mass (g) |
| island | string | island name (Dream, Torgersen, or Biscoe) in the Palmer Archipelago (Antarctica) |
| sex | string | penguin sex |
| year | int | the year the observation was made |

<img src="../images/culmen_depth.png" alt="" width="600"/>

## How to load a CSV file into a `pd.DataFrame`

In [3]:
raw_df = pd.read_csv('../data/penguins_raw.csv')

In [4]:
raw_df.head(3)

,studyName,Sample Number,Species,Region,Island,Stage,Individual ID,Clutch Completion,Date Egg,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex,Delta 15 N (o/oo),Delta 13 C (o/oo),Comments
0,PAL0708,1,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A1,Yes,2007-11-11,39.1,18.7,181.0,3750.0,MALE,NaN,NaN,Not enough blood for isotopes.
1,PAL0708,2,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N1A2,Yes,2007-11-11,39.5,17.4,186.0,3800.0,FEMALE,8.94956,-24.69454,NaN
2,PAL0708,3,Adelie Penguin (Pygoscelis adeliae),Anvers,Torgersen,"Adult, 1 Egg Stage",N2A1,Yes,2007-11-16,40.3,18.0,195.0,3250.0,FEMALE,8.36821,-25.33302,NaN

## How to get feature (i.e column) list

In [5]:
raw_df.columns.tolist()

['studyName',
 'Sample Number',
 'Species',
 'Region',
 'Island',
 'Stage',
 'Individual ID',
 'Clutch Completion',
 'Date Egg',
 'Culmen Length (mm)',
 'Culmen Depth (mm)',
 'Flipper Length (mm)',
 'Body Mass (g)',
 'Sex',
 'Delta 15 N (o/oo)',
 'Delta 13 C (o/oo)',
 'Comments']

## Loading the transformed data

In [6]:
df = pd.read_csv('../data/penguins.csv')
list(df.columns)

['species',
 'island',
 'bill_length_mm',
 'bill_depth_mm',
 'flipper_length_mm',
 'body_mass_g',
 'sex',
 'year']

In [7]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [8]:
df.shape

(344, 8)

In [9]:
df.describe()

,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
count,342.000000,342.000000,342.000000,342.000000,344.000000
mean,43.921930,17.151170,200.915205,4201.754386,2008.029070
std,5.459584,1.974793,14.061714,801.954536,0.818356
min,32.100000,13.100000,172.000000,2700.000000,2007.000000
25%,39.225000,15.600000,190.000000,3550.000000,2007.000000
50%,44.450000,17.300000,197.000000,4050.000000,2008.000000
75%,48.500000,18.700000,213.000000,4750.000000,2009.000000
max,59.600000,21.500000,231.000000,6300.000000,2009.000000

## Categorical Analysis

In [9]:
df['island'].nunique()

3

In [10]:
for island in df['island'].unique().tolist():
    print(island)

Torgersen
Biscoe
Dream

In [10]:
df['island'].value_counts()

Biscoe       168
Dream        124
Torgersen     52
Name: island, dtype: int64

## Data Types

In [11]:
df.dtypes

species               object
island                object
bill_length_mm       float64
bill_depth_mm        float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
year                   int64
dtype: object

In [12]:
raw_df.dtypes

studyName               object
Sample Number            int64
Species                 object
Region                  object
Island                  object
Stage                   object
Individual ID           object
Clutch Completion       object
Date Egg                object
Culmen Length (mm)     float64
Culmen Depth (mm)      float64
Flipper Length (mm)    float64
Body Mass (g)          float64
Sex                     object
Delta 15 N (o/oo)      float64
Delta 13 C (o/oo)      float64
Comments                object
dtype: object

## How to transform `raw_df` into `df`

In [13]:
# load raw data
raw_df = pd.read_csv('../data/penguins_raw.csv')
raw_df.tail(1)

,studyName,Sample Number,Species,Region,Island,Stage,Individual ID,Clutch Completion,Date Egg,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex,Delta 15 N (o/oo),Delta 13 C (o/oo),Comments
343,PAL0910,68,Chinstrap penguin (Pygoscelis antarctica),Anvers,Dream,"Adult, 1 Egg Stage",N100A2,Yes,2009-11-21,50.2,18.7,198.0,3775.0,FEMALE,9.39305,-24.25255,NaN

In [14]:
raw_df.columns.tolist()

['studyName',
 'Sample Number',
 'Species',
 'Region',
 'Island',
 'Stage',
 'Individual ID',
 'Clutch Completion',
 'Date Egg',
 'Culmen Length (mm)',
 'Culmen Depth (mm)',
 'Flipper Length (mm)',
 'Body Mass (g)',
 'Sex',
 'Delta 15 N (o/oo)',
 'Delta 13 C (o/oo)',
 'Comments']

In [15]:
# restrict columns
raw_df = raw_df[[
    'Species', 
    'Island', 
    'Date Egg', 
    'Culmen Length (mm)', 
    'Culmen Depth (mm)', 
    'Flipper Length (mm)',
    'Body Mass (g)',
    'Sex']]

In [16]:
raw_df.tail(1)

,Species,Island,Date Egg,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex
343,Chinstrap penguin (Pygoscelis antarctica),Dream,2009-11-21,50.2,18.7,198.0,3775.0,FEMALE

In [17]:
# convert int to datetime
raw_df['Date Egg'] = pd.to_datetime(raw_df['Date Egg'])

In [18]:
raw_df.dtypes

Species                        object
Island                         object
Date Egg               datetime64[ns]
Culmen Length (mm)            float64
Culmen Depth (mm)             float64
Flipper Length (mm)           float64
Body Mass (g)                 float64
Sex                            object
dtype: object

In [19]:
raw_df.tail(1)

,Species,Island,Date Egg,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex
343,Chinstrap penguin (Pygoscelis antarctica),Dream,2009-11-21,50.2,18.7,198.0,3775.0,FEMALE

In [20]:
# convert date to year
raw_df['year'] = raw_df['Date Egg'].apply(lambda x: x.year)

# drop date feature
raw_df = raw_df.drop('Date Egg',axis=1)

In [21]:
raw_df.columns

Index(['Species', 'Island', 'Culmen Length (mm)', 'Culmen Depth (mm)',
       'Flipper Length (mm)', 'Body Mass (g)', 'Sex', 'year'],
      dtype='object')

In [22]:
# rename columns
raw_df.columns = df.columns

In [23]:
raw_df.head(1)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie Penguin (Pygoscelis adeliae),Torgersen,39.1,18.7,181.0,3750.0,MALE,2007

In [24]:
df.head(1)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007

### apply()

In [25]:
raw_df['species'].unique()

array(['Adelie Penguin (Pygoscelis adeliae)',
       'Gentoo penguin (Pygoscelis papua)',
       'Chinstrap penguin (Pygoscelis antarctica)'], dtype=object)

In [26]:
def clean_species(x):
    if 'Adelie' in x:
        return 'Adelie'
    if 'Gentoo' in x:
        return 'Gentoo'
    if 'Chinstrap' in x:
        return 'Chinstrap'

In [27]:
clean_species('Adelie Penguin (Pygoscelis adeliae)')

'Adelie'

In [28]:
raw_df['species'] = raw_df['species'].apply(clean_species)

In [29]:
raw_df.tail(1)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
343,Chinstrap,Dream,50.2,18.7,198.0,3775.0,FEMALE,2009

### fillna() vs. dropna()

In [30]:
# the "sex" column has missing values
# raw_df['sex'] = raw_df['sex'].fillna('')
# raw_df.dropna(axis=0, subset=['sex'], inplace=True)

# convert to lowercase
raw_df['sex'] = raw_df['sex'].apply(lambda x: x if pd.isna(x) else x.lower())

In [31]:
raw_df.sample(10)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
91,Adelie,Dream,41.1,18.1,205.0,4300.0,male,2008
323,Chinstrap,Dream,49.0,19.6,212.0,4300.0,male,2009
181,Gentoo,Biscoe,50.0,15.3,220.0,5550.0,male,2007
201,Gentoo,Biscoe,45.2,15.8,215.0,5300.0,male,2008
109,Adelie,Biscoe,43.2,19.0,197.0,4775.0,male,2009
92,Adelie,Dream,34.0,17.1,185.0,3400.0,female,2008
34,Adelie,Dream,36.4,17.0,195.0,3325.0,female,2007
122,Adelie,Torgersen,40.2,17.0,176.0,3450.0,female,2009
80,Adelie,Torgersen,34.6,17.2,189.0,3200.0,female,2008
90,Adelie,Dream,35.7,18.0,202.0,3550.0,female,2008

In [32]:
len(raw_df)

344

### Comparing two DataFrames

In [33]:
raw_df.compare(df)

Empty DataFrame
Columns: []
Index: []

## Filtering DataFrames

In [34]:
# use a boolean series to select a subset of rows in the parent data frame
flipper_length_200 = df['flipper_length_mm'] > 200

In [35]:
flipper_length_200.head()

0    False
1    False
2    False
3    False
4    False
Name: flipper_length_mm, dtype: bool

In [36]:
df[ flipper_length_200 ].head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
90,Adelie,Dream,35.7,18.0,202.0,3550.0,female,2008
91,Adelie,Dream,41.1,18.1,205.0,4300.0,male,2008
95,Adelie,Dream,40.8,18.9,208.0,4300.0,male,2008
101,Adelie,Biscoe,41.0,20.0,203.0,4725.0,male,2009
123,Adelie,Torgersen,41.4,18.5,202.0,3875.0,male,2009

In [37]:
# filter using categories
df['island'].value_counts()

Biscoe       168
Dream        124
Torgersen     52
Name: island, dtype: int64

In [38]:
islands_we_care = df['island'].isin(['Biscoe', 'Dream'])
islands_we_care

0      False
1      False
2      False
3      False
4      False
       ...
339     True
340     True
341     True
342     True
343     True
Name: island, Length: 344, dtype: bool

In [39]:
df[ islands_we_care ].sample(10)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
245,Gentoo,Biscoe,49.5,16.1,224.0,5650.0,male,2009
283,Chinstrap,Dream,51.3,18.2,197.0,3750.0,male,2007
340,Chinstrap,Dream,43.5,18.1,202.0,3400.0,female,2009
207,Gentoo,Biscoe,45.0,15.4,220.0,5050.0,male,2008
95,Adelie,Dream,40.8,18.9,208.0,4300.0,male,2008
341,Chinstrap,Dream,49.6,18.2,193.0,3775.0,male,2009
206,Gentoo,Biscoe,46.5,14.4,217.0,4900.0,female,2008
191,Gentoo,Biscoe,48.7,15.7,208.0,5350.0,male,2008
310,Chinstrap,Dream,49.7,18.6,195.0,3600.0,male,2008
175,Gentoo,Biscoe,46.3,15.8,215.0,5050.0,male,2007

## Aggregating DataFrames

In [40]:
df.groupby('species')

In [41]:
groups = df.groupby('species')

In [42]:
groups.describe()

          bill_length_mm                                                   \
                   count       mean       std   min    25%    50%     75%
species
Adelie             151.0  38.791391  2.663405  32.1  36.75  38.80  40.750
Chinstrap           68.0  48.833824  3.339256  40.9  46.35  49.55  51.075
Gentoo             123.0  47.504878  3.081857  40.9  45.30  47.30  49.550

                bill_depth_mm                                                \
            max         count       mean       std   min   25%    50%   75%
species
Adelie     46.0         151.0  18.346358  1.216650  15.5  17.5  18.40  19.0
Chinstrap  58.0          68.0  18.420588  1.135395  16.4  17.5  18.45  19.4
Gentoo     59.6         123.0  14.982114  0.981220  13.1  14.2  15.00  15.7

                flipper_length_mm                                             \
            max             count        mean       std    min    25%    50%
species
Adelie     21.5             151.0  189.953642  6.539457  172.0  186.0  190.0
Chinstrap  20.8              68.0  195.823529  7.131894  178.0  191.0  196.0
Gentoo     17.3             123.0  217.186992  6.484976  203.0  212.0  216.0

                        body_mass_g                                           \
             75%    max       count         mean         std     min     25%
species
Adelie     195.0  210.0       151.0  3700.662252  458.566126  2850.0  3350.0
Chinstrap  201.0  212.0        68.0  3733.088235  384.335081  2700.0  3487.5
Gentoo     221.0  231.0       123.0  5076.016260  504.116237  3950.0  4700.0

                                    year                                 \
              50%     75%     max  count         mean       std     min
species
Adelie     3700.0  4000.0  4775.0  152.0  2008.013158  0.821780  2007.0
Chinstrap  3700.0  3950.0  4800.0   68.0  2007.970588  0.863360  2007.0
Gentoo     5000.0  5500.0  6300.0  124.0  2008.080645  0.792206  2007.0


              25%     50%     75%     max
species
Adelie     2007.0  2008.0  2009.0  2009.0
Chinstrap  2007.0  2008.0  2009.0  2009.0
Gentoo     2007.0  2008.0  2009.0  2009.0

In [43]:
groups.mean()

,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
species,,,,,
Adelie,38.791391,18.346358,189.953642,3700.662252,2008.013158
Chinstrap,48.833824,18.420588,195.823529,3733.088235,2007.970588
Gentoo,47.504878,14.982114,217.186992,5076.016260,2008.080645